**Pandas:**
Let us learn about pandas in python

- pandas in python is a library used to handle datasets.
- It is used to analyse,extract and manipulate data.

In [ ]:
import pandas as pd
import openpyxl

To read the data from the files such as excel or csv, We use the following functions:

i) read_excel(r"path of the file")

 ii)read_csv(r"path of the file")

In [10]:
df = pd.read_excel(r"C:\Users\BASA VIKAS\Downloads\loan_data.xlsx")
df

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP001640,Male,Yes,0,Graduate,Yes,39147,4750.0,120.0,360.0,1.0,Semiurban,Y
610,LP001536,Male,Yes,3+,Graduate,No,39999,0.0,600.0,180.0,0.0,Semiurban,Y
611,LP001585,NaN,Yes,3+,Graduate,No,51763,0.0,700.0,300.0,1.0,Urban,Y
612,LP002101,Male,Yes,0,Graduate,NaN,63337,0.0,490.0,180.0,1.0,Urban,Y
613,LP002317,Male,Yes,3+,Graduate,No,81000,0.0,360.0,360.0,0.0,Rural,N

**How To Inspect the Data:**

To inspect the data we have different type of functions

i)   df.head()  ------> Shows first five rows and all columns 

ii)  df.tail()  ------> Shows last five rows and all columns

iii) df.shape   ------> Displays the count of the rows and columns (234 , 12)--> 234 rows, 12 columns

iv)  df.columns ------> Displays all the columns names

v)   df.info    ------> Displays all information about data

In [11]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y

In [12]:
df.tail()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
609,LP001640,Male,Yes,0,Graduate,Yes,39147,4750.0,120.0,360.0,1.0,Semiurban,Y
610,LP001536,Male,Yes,3+,Graduate,No,39999,0.0,600.0,180.0,0.0,Semiurban,Y
611,LP001585,NaN,Yes,3+,Graduate,No,51763,0.0,700.0,300.0,1.0,Urban,Y
612,LP002101,Male,Yes,0,Graduate,NaN,63337,0.0,490.0,180.0,1.0,Urban,Y
613,LP002317,Male,Yes,3+,Graduate,No,81000,0.0,360.0,360.0,0.0,Rural,N

In [13]:
df.shape

(614, 13)

In [14]:
df.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='str')

In [17]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    str
 1   Gender             601 non-null    str
 2   Married            611 non-null    str
 3   Dependents         599 non-null    object
 4   Education          614 non-null    str
 5   Self_Employed      582 non-null    str
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    str
 12  Loan_Status        614 non-null    str
dtypes: float64(4), int64(1), object(1), str(7)
memory usage: 62.5+ KB

**How to clean Data:**

To clean the data we have to follow the below steps
- Data Selection
- Handling missing values
- Datatype conversions
- Removing Duplicates

**Data Selection:**
We have two simple funtions to select the data from the table

i)  df.loc["Row name","column name"] ---> This function is used when you want to select data based on row name and column name.

ii) df.iloc["Row index","column index"] ---> This function is used when you want to select data based on row index and column index.

In [19]:
#Based on names
df.loc[0:3 , "Loan_ID":"Married"]

    Loan_ID  Gender Married
0  LP001722    Male     Yes
1  LP002502  Female     Yes
2  LP002949  Female      No
3  LP002603  Female      No

In [ ]:
#Based on index
df.iloc[0:3 , 0:3]  # This will give us the first 3 rows and first 3 columns of the dataframe.
                    #  The index 0 means the first row or column and the index 3 means (0,1,2)---> it does not include the index 3 it takes as 3-1=2. So, it will give us the rows with index 0,1,2 and columns with index 0,1,2.

    Loan_ID  Gender Married
0  LP001722    Male     Yes
1  LP002502  Female     Yes
2  LP002949  Female      No

**Handling Missing Values:**
There are three simple steps to be followed 
 
 #Checking Null values
      i) df.isnull().sum() --> Gives all the null values count for each column.

 #Droping null values
      i) df.dropna()---> Drops all null values

 #Filling null values
      i) df.fillna("value to be filled") --> fills the null value with another value

In [23]:
#checking null values
df.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [24]:
#droping null values
df.dropna(inplace=True)

In [25]:
df.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

**Datatype conversions:**
This conversions are used to convert the datatype of a column from one datatype to another data
Syntax:---->
          df["columnname"].astype('Datatype')

In [29]:
df['LoanAmount']= df['LoanAmount'].astype('int')

In [30]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135,360.0,1.0,Rural,N
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113,480.0,1.0,Rural,Y
5,LP001259,Male,Yes,1,Graduate,Yes,1000,3022.0,110,360.0,1.0,Urban,N
6,LP002345,Male,Yes,0,Graduate,No,1025,2773.0,112,360.0,1.0,Rural,Y
8,LP001030,Male,Yes,2,Graduate,No,1299,1086.0,17,120.0,1.0,Urban,Y

**Remove Duplicates:**
Used to remove all duplicates from the rows
 ---> df.drop_duplicates()

In [31]:
df.drop_duplicates(inplace=True)

In [33]:
df.info(    )

<class 'pandas.DataFrame'>
Index: 480 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            480 non-null    str
 1   Gender             480 non-null    str
 2   Married            480 non-null    str
 3   Dependents         480 non-null    object
 4   Education          480 non-null    str
 5   Self_Employed      480 non-null    str
 6   ApplicantIncome    480 non-null    int64
 7   CoapplicantIncome  480 non-null    float64
 8   LoanAmount         480 non-null    int64
 9   Loan_Amount_Term   480 non-null    float64
 10  Credit_History     480 non-null    float64
 11  Property_Area      480 non-null    str
 12  Loan_Status        480 non-null    str
dtypes: float64(3), int64(2), object(1), str(7)
memory usage: 52.5+ KB